## :x: Apply Result (main)

[CI link](https://github.com/Shion1305/Shion1305-infra/actions/runs/16556852236)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
oci_identity_compartment.main-compartment: Refreshing state... [id=ocid1.tenancy.oc1..aaaaaaaa57p4zuoumu3dkeasy3zuom3ouhmxwdk3eo3frkdmvtkpc4nvkqdq]
oci_core_security_list.main-security-list: Refreshing state... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaaaaa55cshiuxh35trjx2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa]
oci_core_vcn.main-vcn: Refreshing state... [id=ocid1.vcn.oc1.ap-tokyo-1.amaaaaaaqiqkkcyavaoppezgphkllmrizfar3ycecg7phwvws4ceipafbdra]
oci_kms_vault.main: Refreshing state... [id=ocid1.vault.oc1.ap-tokyo-1.eztwosspaafyo.abxhiljrc6p3slv4lvmnljlxljomxbe7opkyleyv4jictsq7zedidplooc3q]
oci_core_dhcp_options.main-dhcp-options: Refreshing state... [id=ocid1.dhcpoptions.oc1.ap-tokyo-1.aaaaaaaavdzkksyupctnoqbj2hpo6w63vxtgx227o7hv52kl4nru6bcjvfwa]
oci_core_internet_gateway.main-internet-gateway: Refreshing state... [id=ocid1.internetgateway.oc1.ap-tokyo-1.aaaaaaaaw3dtysi3sctisyiqic4jxduykrhke2eo6dafwrgoqqbpzgung6ma]
oci_core_route_table.main-route-table: Refreshing state... [id=ocid1.routetable.oc1.ap-tokyo-1.aaaaaaaa5pv27xf72rg4p54tenysrpi7rzsvmu7laetwnikkmzdbevhmz4la]
oci_core_subnet.main-subnet: Refreshing state... [id=ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaneghxjqpturxbnptzpcf44egzgd2gzg3el2oxyum2lj3ygczbkeq]
oci_core_instance.instance-2022: Refreshing state... [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcycklw5l5plncwm7nj64rdqpga6zfe67gsn2zzouexqnlwa]
module.oci_compute_instance-k8s.oci_core_instance.this: Refreshing state... [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcycqrbpmpg5ljs6qo33hcfmcll3kbdoukpdbhtoeify2syq]
oci_kms_key.main: Refreshing state... [id=ocid1.key.oc1.ap-tokyo-1.eztwosspaafyo.abxhiljrzskbcgfpswirx3i7sokmf2shh4iadjbgnausysbvrdi7zyjprymq]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # oci_core_instance.instance-2022 will be updated in-place
  ~ resource "oci_core_instance" "instance-2022" {
        id                          = "ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcycklw5l5plncwm7nj64rdqpga6zfe67gsn2zzouexqnlwa"
        # (24 unchanged attributes hidden)

      ~ create_vnic_details {
          ~ nsg_ids                   = [] -> (known after apply)
            # (12 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # oci_core_network_security_group.k8s-nsg will be created
  + resource "oci_core_network_security_group" "k8s-nsg" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa57p4zuoumu3dkeasy3zuom3ouhmxwdk3eo3frkdmvtkpc4nvkqdq"
      + defined_tags   = (known after apply)
      + display_name   = "K8s Network Security Group - No Restrictions"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = "ocid1.vcn.oc1.ap-tokyo-1.amaaaaaaqiqkkcyavaoppezgphkllmrizfar3ycecg7phwvws4ceipafbdra"
    }

  # oci_core_network_security_group.main-nsg will be created
  + resource "oci_core_network_security_group" "main-nsg" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa57p4zuoumu3dkeasy3zuom3ouhmxwdk3eo3frkdmvtkpc4nvkqdq"
      + defined_tags   = (known after apply)
      + display_name   = "Main Network Security Group"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = "ocid1.vcn.oc1.ap-tokyo-1.amaaaaaaqiqkkcyavaoppezgphkllmrizfar3ycecg7phwvws4ceipafbdra"
    }

  # oci_core_network_security_group_security_rule.k8s-nsg-egress-rule will be created
  + resource "oci_core_network_security_group_security_rule" "k8s-nsg-egress-rule" {
      + description               = (known after apply)
      + destination               = "0.0.0.0/0"
      + destination_type          = "CIDR_BLOCK"
      + direction                 = "EGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "all"
      + source_type               = (known after apply)
      + stateless                 = (known after apply)
      + time_created              = (known after apply)
    }

  # oci_core_network_security_group_security_rule.k8s-nsg-ingress-rule will be created
  + resource "oci_core_network_security_group_security_rule" "k8s-nsg-ingress-rule" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "all"
      + source                    = "0.0.0.0/0"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)
    }

  # oci_core_network_security_group_security_rule.main-nsg-egress-rule will be created
  + resource "oci_core_network_security_group_security_rule" "main-nsg-egress-rule" {
      + description               = (known after apply)
      + destination               = "0.0.0.0/0"
      + destination_type          = "CIDR_BLOCK"
      + direction                 = "EGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "all"
      + source_type               = (known after apply)
      + stateless                 = (known after apply)
      + time_created              = (known after apply)
    }

  # oci_core_network_security_group_security_rule.main-nsg-ingress-4914 will be created
  + resource "oci_core_network_security_group_security_rule" "main-nsg-ingress-4914" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source                    = "0.0.0.0/0"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = true
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 4914
              + min = 4914
            }
        }
    }

  # oci_core_network_security_group_security_rule.main-nsg-ingress-6443 will be created
  + resource "oci_core_network_security_group_security_rule" "main-nsg-ingress-6443" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source                    = "0.0.0.0/0"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = true
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 6443
              + min = 6443
            }
        }
    }

  # oci_core_network_security_group_security_rule.main-nsg-ingress-http will be created
  + resource "oci_core_network_security_group_security_rule" "main-nsg-ingress-http" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source                    = "0.0.0.0/0"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 80
              + min = 80
            }
        }
    }

  # oci_core_network_security_group_security_rule.main-nsg-ingress-https will be created
  + resource "oci_core_network_security_group_security_rule" "main-nsg-ingress-https" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source                    = "0.0.0.0/0"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 443
              + min = 443
            }
        }
    }

  # oci_core_network_security_group_security_rule.main-nsg-ingress-icmp-anywhere will be created
  + resource "oci_core_network_security_group_security_rule" "main-nsg-ingress-icmp-anywhere" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "1"
      + source                    = "0.0.0.0/0"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)

      + icmp_options {
          + code = 4
          + type = 3
        }
    }

  # oci_core_network_security_group_security_rule.main-nsg-ingress-icmp-vcn will be created
  + resource "oci_core_network_security_group_security_rule" "main-nsg-ingress-icmp-vcn" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "1"
      + source                    = "10.0.0.0/16"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)

      + icmp_options {
          + code = -1
          + type = 3
        }
    }

  # oci_core_network_security_group_security_rule.main-nsg-ingress-ssh will be created
  + resource "oci_core_network_security_group_security_rule" "main-nsg-ingress-ssh" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source                    = "0.0.0.0/0"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 22
              + min = 22
            }
        }
    }

  # oci_core_security_list.main-security-list will be destroyed
  # (because oci_core_security_list.main-security-list is not in configuration)
  - resource "oci_core_security_list" "main-security-list" {
      - compartment_id = "ocid1.tenancy.oc1..aaaaaaaa57p4zuoumu3dkeasy3zuom3ouhmxwdk3eo3frkdmvtkpc4nvkqdq" -> null
      - defined_tags   = {
          - "Oracle-Tags.CreatedBy" = "shion1305@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2021-11-10T01:32:16.204Z"
        } -> null
      - display_name   = "Default Security List for vcn-20211110-1031" -> null
      - freeform_tags  = {} -> null
      - id             = "ocid1.securitylist.oc1.ap-tokyo-1.aaaaaaaa55cshiuxh35trjx2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa" -> null
      - state          = "AVAILABLE" -> null
      - time_created   = "2021-11-10 01:32:16.311 +0000 UTC" -> null
      - vcn_id         = "ocid1.vcn.oc1.ap-tokyo-1.amaaaaaaqiqkkcyavaoppezgphkllmrizfar3ycecg7phwvws4ceipafbdra" -> null

      - egress_security_rules {
          - destination      = "0.0.0.0/0" -> null
          - destination_type = "CIDR_BLOCK" -> null
          - protocol         = "all" -> null
          - stateless        = false -> null
            # (1 unchanged attribute hidden)
        }

      - ingress_security_rules {
          - protocol    = "1" -> null
          - source      = "10.0.0.0/16" -> null
          - source_type = "CIDR_BLOCK" -> null
          - stateless   = false -> null
            # (1 unchanged attribute hidden)

          - icmp_options {
              - code = -1 -> null
              - type = 3 -> null
            }
        }
      - ingress_security_rules {
          - protocol    = "1" -> null
          - source      = "0.0.0.0/0" -> null
          - source_type = "CIDR_BLOCK" -> null
          - stateless   = false -> null
            # (1 unchanged attribute hidden)

          - icmp_options {
              - code = 4 -> null
              - type = 3 -> null
            }
        }
      - ingress_security_rules {
          - protocol    = "6" -> null
          - source      = "0.0.0.0/0" -> null
          - source_type = "CIDR_BLOCK" -> null
          - stateless   = false -> null
            # (1 unchanged attribute hidden)

          - tcp_options {
              - max = 22 -> null
              - min = 22 -> null
            }
        }
      - ingress_security_rules {
          - protocol    = "6" -> null
          - source      = "0.0.0.0/0" -> null
          - source_type = "CIDR_BLOCK" -> null
          - stateless   = false -> null
            # (1 unchanged attribute hidden)

          - tcp_options {
              - max = 443 -> null
              - min = 443 -> null
            }
        }
      - ingress_security_rules {
          - protocol    = "6" -> null
          - source      = "0.0.0.0/0" -> null
          - source_type = "CIDR_BLOCK" -> null
          - stateless   = false -> null
            # (1 unchanged attribute hidden)

          - tcp_options {
              - max = 80 -> null
              - min = 80 -> null
            }
        }
      - ingress_security_rules {
          - protocol    = "6" -> null
          - source      = "0.0.0.0/0" -> null
          - source_type = "CIDR_BLOCK" -> null
          - stateless   = true -> null
            # (1 unchanged attribute hidden)

          - tcp_options {
              - max = 4914 -> null
              - min = 4914 -> null
            }
        }
      - ingress_security_rules {
          - protocol    = "6" -> null
          - source      = "0.0.0.0/0" -> null
          - source_type = "CIDR_BLOCK" -> null
          - stateless   = true -> null
            # (1 unchanged attribute hidden)

          - tcp_options {
              - max = 6443 -> null
              - min = 6443 -> null
            }
        }
    }

  # oci_core_security_list.permissive-security-list will be created
  + resource "oci_core_security_list" "permissive-security-list" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa57p4zuoumu3dkeasy3zuom3ouhmxwdk3eo3frkdmvtkpc4nvkqdq"
      + defined_tags   = (known after apply)
      + display_name   = "Security List - Allow All"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = "ocid1.vcn.oc1.ap-tokyo-1.amaaaaaaqiqkkcyavaoppezgphkllmrizfar3ycecg7phwvws4ceipafbdra"

      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "0.0.0.0/0"
          + destination_type = "CIDR_BLOCK"
          + protocol         = "all"
          + stateless        = false
        }

      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "all"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false
        }
    }

  # oci_core_subnet.main-subnet will be updated in-place
  ~ resource "oci_core_subnet" "main-subnet" {
        id                         = "ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaneghxjqpturxbnptzpcf44egzgd2gzg3el2oxyum2lj3ygczbkeq"
      ~ security_list_ids          = [
          - "ocid1.securitylist.oc1.ap-tokyo-1.aaaaaaaa55cshiuxh35trjx2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa",
        ] -> (known after apply)
        # (17 unchanged attributes hidden)
    }

  # module.oci_compute_instance-k8s.oci_core_instance.this will be updated in-place
  ~ resource "oci_core_instance" "this" {
        id                          = "ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcycqrbpmpg5ljs6qo33hcfmcll3kbdoukpdbhtoeify2syq"
        # (25 unchanged attributes hidden)

      ~ create_vnic_details {
          ~ nsg_ids                   = [] -> (known after apply)
            # (12 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

Plan: 13 to add, 3 to change, 1 to destroy.
oci_core_network_security_group.main-nsg: Creating...
oci_core_network_security_group.k8s-nsg: Creating...
oci_core_security_list.permissive-security-list: Creating...
oci_core_security_list.main-security-list: Destroying... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaaaaa55cshiuxh35trjx2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa]
oci_core_security_list.permissive-security-list: Creation complete after 1s [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaaaaax2e22ekjmabsofg5mjg5ab2ofn6f5h7ki2o55d33a5lnpjiil2pq]
oci_core_network_security_group.k8s-nsg: Creation complete after 1s [id=ocid1.networksecuritygroup.oc1.ap-tokyo-1.aaaaaaaareo3ddfn7ljzuyyfungeuweyh2tdfn7b2ty3gvxqmx4ig5equobq]
oci_core_network_security_group_security_rule.k8s-nsg-ingress-rule: Creating...
oci_core_network_security_group_security_rule.k8s-nsg-egress-rule: Creating...
oci_core_network_security_group_security_rule.k8s-nsg-egress-rule: Creation complete after 0s [id=E81293]
oci_core_network_security_group_security_rule.k8s-nsg-ingress-rule: Creation complete after 0s [id=69ADF9]
oci_core_network_security_group.main-nsg: Creation complete after 2s [id=ocid1.networksecuritygroup.oc1.ap-tokyo-1.aaaaaaaahp37aglobhkas5lmadw7e4z3ga2c63x2ua3th4n3z6maulg5movq]
oci_core_network_security_group_security_rule.main-nsg-ingress-icmp-vcn: Creating...
oci_core_network_security_group_security_rule.main-nsg-egress-rule: Creating...
oci_core_network_security_group_security_rule.main-nsg-ingress-https: Creating...
oci_core_network_security_group_security_rule.main-nsg-ingress-http: Creating...
oci_core_network_security_group_security_rule.main-nsg-ingress-4914: Creating...
oci_core_network_security_group_security_rule.main-nsg-ingress-icmp-anywhere: Creating...
oci_core_network_security_group_security_rule.main-nsg-ingress-6443: Creating...
oci_core_network_security_group_security_rule.main-nsg-ingress-ssh: Creating...
oci_core_network_security_group_security_rule.main-nsg-egress-rule: Creation complete after 0s [id=64D939]
oci_core_network_security_group_security_rule.main-nsg-ingress-icmp-vcn: Creation complete after 0s [id=0ABC1F]
oci_core_network_security_group_security_rule.main-nsg-ingress-ssh: Creation complete after 0s [id=A8BD62]
oci_core_network_security_group_security_rule.main-nsg-ingress-http: Creation complete after 0s [id=0F961E]
oci_core_network_security_group_security_rule.main-nsg-ingress-https: Creation complete after 0s [id=198AFA]
oci_core_network_security_group_security_rule.main-nsg-ingress-icmp-anywhere: Creation complete after 1s [id=DABF11]
oci_core_network_security_group_security_rule.main-nsg-ingress-6443: Creation complete after 1s [id=F8952E]
oci_core_network_security_group_security_rule.main-nsg-ingress-4914: Creation complete after 1s [id=71A3BD]
oci_core_security_list.main-security-list: Still destroying... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaa...x2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa, 10s elapsed]
oci_core_security_list.main-security-list: Still destroying... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaa...x2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa, 20s elapsed]
oci_core_security_list.main-security-list: Still destroying... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaa...x2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa, 30s elapsed]
oci_core_security_list.main-security-list: Still destroying... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaa...x2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa, 40s elapsed]
oci_core_security_list.main-security-list: Still destroying... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaa...x2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa, 50s elapsed]
oci_core_security_list.main-security-list: Still destroying... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaa...x2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa, 1m0s elapsed]
oci_core_security_list.main-security-list: Still destroying... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaa...x2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa, 1m10s elapsed]
oci_core_security_list.main-security-list: Still destroying... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaa...x2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa, 1m20s elapsed]
oci_core_security_list.main-security-list: Still destroying... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaa...x2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa, 1m30s elapsed]
oci_core_security_list.main-security-list: Still destroying... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaa...x2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa, 1m40s elapsed]
oci_core_security_list.main-security-list: Still destroying... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaa...x2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa, 1m50s elapsed]
oci_core_security_list.main-security-list: Still destroying... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaa...x2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa, 2m0s elapsed]
╷
│ Error: 409-IncorrectState, ocid1.securitylist.oc1.ap-tokyo-1.aaaaaaaa55cshiuxh35trjx2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa is associated with subnet security list association that is in use
│ Suggestion: The resource is in a conflicted state. Please retry again or contact support for help with service: Core Security List
│ Documentation: https://registry.terraform.io/providers/oracle/oci/latest/docs/resources/core_security_list 
│ API Reference:  
│ Request Target: DELETE https://iaas.ap-tokyo-1.oraclecloud.com/20160918/securityLists/ocid1.securitylist.oc1.ap-tokyo-1.aaaaaaaa55cshiuxh35trjx2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa 
│ Provider version: 6.18.0, released on 2024-11-13. This provider is 36 Update(s) behind to current. 
│ Service: Core Security List 
│ Operation Name: DeleteSecurityList 
│ OPC request ID: 3083fdf7fc15fc8de8f3a5561f070da5/BCADDC247FD20783A7D98C9ED1A06E95/CF73C49B666607E0B37B0BAB9752DCBF 
│ 
│ 
│ 
╵

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"run-terragrunt-apply","PRNumber":46,"Program":"tfcmt","SHA1":"a62da393726a5c8e566cd55f86f4eaafa066a78f","Target":"main","Vars":{},"WorkflowName":"Run Apply on OCI"} -->